openFoamRepoDev/tutorials/combustion/fireFoam/LES/oppositeBurningPanels/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss LUST grad(U);
    div(phi,K)      Gauss limitedLinear 1;
    div(phi,k)      Gauss limitedLinear 1;
    div(phi,Yi_h)   Gauss multivariateSelection
    {
        O2              linearUpwind grad(O2);
        N2              linearUpwind grad(N2);
        C3H8            linearUpwind grad(C3H8);
        H2O             linearUpwind grad(H2O);
        CO2             linearUpwind grad(CO2);
        h               linearUpwind grad(h);
    };
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
    div(Ji,Ii_h)        Gauss upwind;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
